{
    "cik": "789019",
    "company": "MICROSOFT CORP",
    "filing_type": "8-K",
    "filing_date": "2022-06-02",
    "period_of_report": "2022-06-02",
    "sic": "7372",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-22-165839-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/000119312522165839/d295016d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-22-165839.txt",
    "filename": "789019_8K_2022_0001193125-22-165839.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "Item 7.01. Regulation FD Disclosure\nOn June 2, 2022, Microsoft Corporation updated our guidance for the quarter ending June 30, 2022 due to unfavorable foreign exchange rate movement in the quarter through May. A slide deck with our revised guidance is furnished as Exhibit 99.1 to this report.\nThis Form 8-K contains forward-looking statements, which are any predictions, projections or other statements about future events based on current expectations and assumptions that are subject to risks and uncertainties, which are described in our filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and Microsoft undertakes no duty to update any forward-looking statement to conform the statement to actual results or changes in the company’s expectations.\nIn accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liability of that section, and shall not be incorporated by reference into any registration statement or other document filed under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.",
    "item_7A": "",
    "item_8": ""
}