{
    "cik": "789019",
    "company": "MICROSOFT CORP",
    "filing_type": "8-K",
    "filing_date": "2023-10-11",
    "period_of_report": "2023-10-11",
    "sic": "7372",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-23-254151-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/000119312523254151/d530324d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-23-254151.txt",
    "filename": "789019_8K_2023_0001193125-23-254151.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01. Other Information\nOn October 11, 2023, Microsoft Corporation announced the receipt of Notices of Proposed Adjustment (“NOPAs”) from the Internal Revenue Service (the “IRS”) for the tax years 2004 to 2013. The NOPAs were received on September 26, 2023. The primary issues in the NOPAs relate to intercompany transfer pricing. In the NOPAs, the IRS is seeking an additional tax payment of $28.9 billion plus penalties and interest. As of September 30, 2023, we believe our allowances for income tax contingencies are adequate. We disagree with the proposed adjustments and will vigorously contest the NOPAs through the IRS’s administrative appeals office and, if necessary, judicial proceedings. We do not expect a final resolution of these issues in the next 12 months. Based on the information currently available, we do not anticipate a significant increase or decrease to our tax contingencies for these issues within the next 12 months.\nThis Form 8-K contains forward-looking statements, which are any predictions, projections or other statements about future events based on current expectations and assumptions that are subject to risks and uncertainties, which are described in our filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and Microsoft undertakes no duty to update any forward-looking statement to conform the statement to actual results or changes in the company’s expectations."
}