{
    "cik": "789019",
    "company": "MICROSOFT CORP",
    "filing_type": "8-K",
    "filing_date": "2020-06-01",
    "period_of_report": "2020-05-29",
    "sic": "7372",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-20-157234-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/000119312520157234/d829164d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-20-157234.txt",
    "filename": "789019_8K_2020_0001193125-20-157234.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01 Other Events.\nOn May 29, 2020, Microsoft Corporation (the “Company”) issued a press release announcing the expiration of its previously announced exchange offers for certain of its outstanding debt securities that were validly tendered (and not validly withdrawn) by holders at or prior to such expiration at 11:59 p.m., New York City time, on May 28, 2020 (the “Exchange Offers”). The press release is attached hereto as Exhibit 99.1 and is incorporated herein by reference.\nOn June 1, 2020, in connection with the settlement of the Exchange Offers, the Company issued $6,249,997,000 aggregate principal amount of its 2.525% Notes due 2050 (the “2050 Notes”) and $3,750,000,000 aggregate principal amount of its 2.675% Notes due 2060 (the “2060 Notes”) (collectively, the “New Notes”). The New Notes were exchanged in the Exchange Offers pursuant to the terms and conditions set forth in the Company’s prospectus, dated May 19, 2020 (the “Prospectus”), filed with the Securities and Exchange Commission on May 19, 2020.\nThe New Notes were issued pursuant to an indenture, dated as of May 18, 2009 (the “Base Indenture”), between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee, as amended and supplemented by the Thirteenth Supplemental Indenture thereto, dated as of June 1, 2020 (the “Thirteenth Supplemental Indenture”), between the Company and U.S. Bank National Association, as trustee.\nThe Base Indenture is set forth as Exhibit 4.1 to the Company’s Registration Statement on Form S-4 (File No. 333-237925), as amended by Amendment No. 1 thereto.\nInterest on the New Notes will be payable semi-annually in arrears on June 1 and December 1 of each year, commencing on December 1, 2020, to holders of record on the preceding May 15 or the November 15, as the case may be. The 2050 Notes will mature on June 1, 2050 and the 2060 Notes will mature on June 1, 2060.\nThe Company will have the option to redeem the New Notes in certain circumstances described in the Prospectus.\nThe New Notes will be the Company’s senior unsecured obligations and will rank equally with the Company’s other unsecured and unsubordinated debt from time to time outstanding.\nThe foregoing descriptions of the Thirteenth Supplemental Indenture (including the forms of the New Notes) are qualified in their entirety by the terms of such agreement. Please refer to such agreement, which is incorporated herein by reference and attached hereto as Exhibit 4.1."
}