{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2023-01-25",
    "period_of_report": "2023-01-20",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-23-000799-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459023000799/tsla-8k_20230120.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-23-000799.txt",
    "filename": "1318605_8K_2023_0001564590-23-000799.htm",
    "item_1": "Item 1.01Entry Into a Material Definitive Agreement.\nRevolving Credit Facility\nOn January 20, 2023, Tesla, Inc. (“Tesla”) entered into a credit agreement (the “RCF Credit Agreement”) with Citibank, N.A., as administrative agent, Deutsche Bank Securities Inc. and the lenders and other agents party thereto. The RCF Credit Agreement provides for a senior unsecured revolving credit facility of up to $5.0 billion (the “Credit Facility”), which Tesla may draw upon from time to time. Tesla may increase the total commitments under the Credit Facility by up to an additional $2.0 billion, subject to certain conditions, potentially increasing the Credit Facility to $7.0 billion. The Credit Facility provides for the issuance of letters of credit. The proceeds of the loans may be used for general corporate purposes or for any other purpose not otherwise prohibited by the RCF Credit Agreement. The Credit Facility terminates, and all outstanding loans, if any, become due and payable on January 20, 2028. Tesla may request up to two one-year extensions of the facility. No loans were outstanding under the Credit Facility as of January 25, 2023.\nOutstanding borrowings under the Credit Facility accrue interest at a variable rate equal to:\n•\nfor dollar-denominated loans, at the Company’s election, (a) Term SOFR (the forward-looking secured overnight financing rate) plus 0.10%, or (b) an alternate base rate;\n•\nfor loans denominated in pounds sterling, SONIA (the sterling overnight index average reference rate); or\n•\nfor loans denominated in euros, an adjusted EURIBOR rate;\nin each case, plus an applicable margin. The applicable margin will be based on the rating assigned to Tesla’s senior, unsecured long-term indebtedness from time to time.\nTesla accrues a fee based on the daily unused portion of the Credit Facility. Such fee is also based on the rating assigned to Tesla’s senior, unsecured long-term indebtedness from time to time and is payable quarterly.\nThe Credit Facility contains covenants that are usual for this type of facility. These covenants include, among others, restrictions on liens and the incurrence of debt by Tesla’s subsidiaries, each subject to exceptions and limitations. The Credit Facility also requires that Tesla maintain $1.0 billion of liquidity (as calculated pursuant to the RCF Credit Agreement). The Credit Facility contains customary events of default. Upon the occurrence of an event of default, the lenders may require the immediate payment of all amounts outstanding.\nItem 1.02Termination of a Material Definitive Agreement.\nTermination of ABL Credit Agreement\nAs previously reported, Tesla and its subsidiaries Tesla Motors Netherlands B.V. and Tesla Motors Limited (together with Tesla and Tesla Motors Netherlands B.V., the “Borrowers”) are parties to that certain Amended and Restated ABL Credit Agreement, dated as of March 6, 2019 (as further amended from time to time, the “ABL Credit Agreement”), with Deutsche Bank AG New York Branch, as administrative agent and collateral agent, and the lenders and other agents party thereto. The ABL Credit Agreement was set to mature on July 1, 2023. On January 20, 2023, the ABL Credit Agreement was terminated by the parties. The Borrowers did not have any borrowings outstanding under the ABL Credit Agreement and did not incur any early termination penalties in connection with the termination of the ABL Credit Agreement. Some of the lenders under the ABL Credit Agreement, or their affiliates, are lenders under the RCF Credit Agreement.",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": ""
}