{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2018-10-01",
    "period_of_report": "2018-09-30",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-18-023716-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459018023716/tsla-8k_20180930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-18-023716.txt",
    "filename": "1318605_8K_2018_0001564590-18-023716.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "Item 7.01Regulation FD Disclosure.\nOn September 30, 2018, Elon Musk, Tesla’s Chief Executive Officer, sent to all Tesla employees the e-mail which is attached hereto as Exhibit 99.1 and is incorporated herein by reference.\nTesla’s quarterly results are preliminary and remain subject to the completion of Tesla’s customary quarterly close and review procedures. Material adjustments may arise between the date of this Current Report on Form 8-K and the dates on which Tesla announces its full third quarter results and files its Quarterly Report on Form 10-Q for the quarter ended September 30, 2018.\nForward-Looking Statements\nCertain statements herein, including statements regarding future profitability, are “forward-looking statements” that are subject to risks and uncertainties. These forward-looking statements are based on management’s current expectations. Various important factors could cause actual results to differ materially, including the completion of the procedures referenced above and other risks identified in our filings with the Securities and Exchange Commission. Tesla disclaims any obligation to update this information.\nThis information is intended to be furnished under Items 2.02 and 7.01 of Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.",
    "item_7A": "",
    "item_8": ""
}