{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2019-05-08",
    "period_of_report": "2019-05-03",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-016764-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459019016764/tsla-8k_20190503.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-016764.txt",
    "filename": "1318605_8K_2019_0001564590-19-016764.htm",
    "item_1": "Item 1.01\nEntry into a Material Definitive Agreement\nThe information set forth in Item 8.01 of this Current Report on Form 8-K under the headings “Supplemental Indenture Relating to Convertible Senior Notes,” “Additional Note Hedge Transactions” and “Additional Warrant Transactions” is incorporated by reference into this Item 1.01.",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01\nOther Events\nOn May 7, 2019, Tesla, Inc. (the “Company”) closed its previously announced underwritten public offerings of (1) 3,549,381 shares of common stock of the Company, par value $0.001 per share (the “Common Stock”), which includes 462,962 shares sold pursuant to the underwriters’ (the “Underwriters”) option to purchase additional shares, which was exercised in full on May 3, 2019; and (2) $1.84 billion aggregate principal amount of the Company’s 2.00% Convertible Senior Notes due May 15, 2024 (the “Notes”), which includes $240.0 million aggregate principal amount of Notes sold pursuant to the Underwriters’ option to purchase additional Notes (the “Option Notes”), which was exercised in full on May 3, 2019, in each case pursuant to a Registration Statement on Form S-3 (File No. 333-231168) (the “Registration Statement”) and accompanying prospectus, together with the related prospectus supplements for the underwritten public offerings of the Common Stock and the Notes, filed with the Securities and Exchange Commission.\nIn connection with these offerings, the legal opinion as to the legality of the Common Stock and the Notes sold is being filed as Exhibit 5.1 to this Current Report on Form 8-K and is incorporated herein and into the Registration Statement by reference.\nSupplemental Indenture Relating to Convertible Senior Notes\nOn May 7, 2019, the Company entered into a Fifth Supplemental Indenture relating to the issuance by the Company of the Notes (the “Supplemental Indenture”) supplementing the Indenture, dated May 22, 2013 (the “Base Indenture,” and together with the Supplemental Indenture, the “Indenture”), by and between the Company and U.S. Bank National Association , as trustee (the “Trustee”). The Notes will bear interest at a rate of 2.00% per year, payable semi-annually in arrears on May 15 and November 15 of each year, commencing November 15, 2019. The Notes will mature on May 15, 2024, unless, in each case, earlier repurchased by the Company or converted pursuant to their respective terms.\nThe initial conversion rate of the Notes is 3.2276 shares of Common Stock per $1,000 principal amount of the Notes (which is equivalent to an initial conversion price of approximately $309.83 per share). The conversion rate for the Notes will be subject to adjustment upon the occurrence of certain specified events but will not be adjusted for accrued and unpaid interest. In addition, upon the occurrence of a “make-whole fundamental change” (as defined in the Supplemental Indenture), the Company will, in certain circumstances, increase the conversion rate by a number of additional shares for a holder that elects to convert the Notes in connection with such make-whole fundamental change.\nPrior to the close of business on the business day immediately preceding February 15, 2024, the Notes will be convertible only under the following circumstances: (1) during any calendar quarter commencing after September 30, 2019 (and only during such calendar quarter), if the last reported sale price of the Common Stock for at least 20 trading days (whether or not consecutive) during a period of 30 consecutive trading days ending on the last trading day of the immediately preceding calendar quarter is greater than or equal to 130% of the conversion price on each trading day; (2) during the five business day period after any five consecutive trading day period in which the trading price per $1,000 principal amount of the Notes for each trading day of such period was less than 98% of the product of the last reported sale price of Common Stock and the conversion rate on each such trading day; or (3) upon the occurrence of specified corporate events. On or after February 15, 2024, until the close of business on the second scheduled trading day immediately preceding the maturity date, holders may convert the Notes at any time. Upon conversion, the Notes will be settled in cash, shares of Common Stock or a combination thereof, at the Company’s election.\nThe Company may not redeem the Notes prior to the maturity date; however, upon the occurrence of a fundamental change (as defined in the Supplemental Indenture), holders may require the Company to purchase all or a portion of the Notes for cash at a price equal to 100% of the principal amount of the Notes to be purchased plus any accrued and unpaid interest to, but excluding, the fundamental change purchase date.\nThe Notes will be the Company’s senior unsecured obligations and will rank senior in right of payment to any of the Company’s indebtedness that is expressly subordinated in right of payment to the Notes, will rank equally in right of payment with any of the Company’s unsecured indebtedness that is not so subordinated, including the Company’s outstanding 1.25% Convertible Senior Notes due 2021, 2.375% Convertible Senior Notes due 2022, and 5.30% Senior Notes due 2025, and will be effectively junior in right of payment to any of the Company’s secured indebtedness to the extent of the value of the assets securing such indebtedness and will be structurally subordinated to all indebtedness and other liabilities of the Company’s subsidiaries.\nEach of the following events is considered an “event of default” with respect to the Notes, which may result in the acceleration of the maturity of the Notes:\n(1)\na default in any payment of interest on the Notes when due and payable and the default continues for a period of 30 days;\n(2)\na default in the payment of principal of the Notes when due and payable at the stated maturity, upon any required purchase, upon declaration of acceleration or otherwise;\n(3)\nthe Company’s failure to comply with its obligation to convert the Notes upon exercise of a holder’s conversion right for a period of five business days;\n(4)\nthe Company’s failure to comply with its obligations under the Indenture with respect to consolidation, merger and sale of assets of the Company;\n(5)\nthe Company’s failure to give a fundamental change notice at the time, in the manner, and with the contents under the Indenture when due;\n(6)\nthe Company’s failure for 60 days after written notice from the Trustee or the holders of at least 25% in principal amount of the Notes then outstanding has been received to comply with any of the Company’s other agreements contained in the Global Note (as defined below) or the Indenture;\n(7)\na default by the Company or any “significant subsidiary” (as defined in the Supplemental Indenture) with respect to any mortgage, agreement or other instrument under which there may be outstanding, or by which there may be secured or evidenced, any indebtedness for money borrowed in excess of $500 million (or its foreign currency equivalent) in the aggregate of the Company and/or any such subsidiary, whether such indebtedness now exists or shall hereafter be created constituting a failure to pay the principal of any such debt when due and payable at its stated maturity, upon required purchase, upon declaration of acceleration or otherwise, unless such principal is paid (or the indebtedness with respect thereto is discharged) or such payment of such principal is waived or is otherwise no longer due\nand payable or such acceleration is rescinded or annulled prior to a date that is 30 days after written notice from the Trustee or the holders of at least 25% in principal amount of the Notes (provided, however, that if such principal is paid (or the indebtedness with respect thereto is discharged) or such payment of such principal is waived or is otherwise no longer due and payable or such acceleration is rescinded or annulled, then the event of default by reason of the failure to pay such principal when due shall be deemed not to have occurred); and\n(8)\ncertain events of bankruptcy, insolvency, or reorganization of the Company or any “significant subsidiary.”\nIf an event of default occurs with respect to the Notes, and is continuing (other than an event of default described in clause (8) above with respect to the Company (and not with respect to a “significant subsidiary”)), the Trustee by notice to the Company, or the holders of at least 25% in principal amount of the outstanding Notes, by notice to the Company and the Trustee, may declare 100% of the principal of and accrued and unpaid interest on all the Notes to be due and payable; upon such a declaration, such principal and any accrued and unpaid interest will be due and payable immediately, subject to certain limitations in the case of an event of default relating to certain failures by the Company to make certain filings required by it to be made with the Trustee or the Securities and Exchange Commission pursuant to the Trust Indenture Act of 1939, as amended, or the Securities Exchange Act of 1934, as amended, respectively. Upon an event of default described in clause (8) above with respect to the Company, 100% of the aggregate principal amount and accrued and unpaid interest on the Notes will automatically be due and payable immediately.\nThe summary of the foregoing transactions is qualified in its entirety by reference to the text of the Base Indenture, the Supplemental Indenture, and the Form of 2.00% Convertible Senior Note due May 15, 2024 included in the Supplemental Indenture (the “Global Note”), which are filed as Exhibits 4.1, 4.2 and 4.3, respectively, with this Current Report on Form 8-K and are incorporated herein and into the Registration Statement by reference.\nAdditional Note Hedge Transactions\nOn May 3, 2019, in connection with the exercise of the Underwriters’ option to purchase the Option Notes, the Company entered into additional note hedge transactions (the “Additional Note Hedge Transactions”) with each of Société Générale, Wells Fargo Bank, National Association, Goldman Sachs & Co. LLC, and Credit Suisse Capital LLC, with Credit Suisse Securities (USA) LLC as agent, or their respective affiliates (the “Hedge Counterparties”), pursuant to call option confirmations in substantially the form of Exhibit 10.1 to this Current Report on Form 8-K, which is incorporated herein by reference. The Additional Note Hedge Transactions are expected generally to reduce the potential dilution to the Common Stock, and/or offset potential cash payments in excess of the principal amount upon any conversion of the Option Notes in the event that the market value per share of the Common Stock, as measured under the terms of the Additional Note Hedge Transactions, is greater than the strike prices of the Additional Note Hedge Transactions (which correspond to the initial conversion price of the Notes and are subject to certain adjustments substantially similar to those contained in the Notes). On May 7, 2019, at the closing of the offering of the Notes, the Company paid an aggregate amount of approximately $475.8 million to the Hedge Counterparties for note hedge transactions in connection with the Notes, including approximately $62.1 million for the Additional Note Hedge Transactions.\nAdditional Warrant Transactions\nOn May 3, 2019, in connection with the exercise of the Underwriters’ option to purchase the Option Notes, the Company entered into additional warrant confirmations with each of the Hedge Counterparties in substantially the form of Exhibit 10.2 to this Current Report on Form 8-K, which is incorporated herein by reference, pursuant to which the Company issued certain warrants (the “Additional Warrants”). The Additional Warrants allow the Hedge Counterparties to acquire, subject to anti-dilution adjustments, up to approximately 1.5 million shares of Common Stock at a strike price of $607.50 per share, which is also subject to adjustment. The Additional Warrants would separately have a dilutive effect to the extent that the market value per share of the\nCommon Stock exceeds the strike price of the Additional Warrants unless, subject to the terms of the warrant confirmations, the Company elects to cash settle the Additional Warrants. The Additional Warrants were issued pursuant to the exemption provided by Section 4(a)(2) of the Securities Act of 1933, as amended. The Additional Warrants are separate transactions, entered into by the Company with the Hedge Counterparties, and are not part of the terms of the Option Notes. Holders of the Option Notes will not have any rights with respect to the Additional Warrants. On May 7, 2019, at the closing of the offering of the Notes, the Company received aggregate proceeds of approximately $174.4 million from the sale of warrants in connection with the Notes, including approximately $22.8 million for the Additional Warrants."
}