{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2019-05-03",
    "period_of_report": "2019-05-01",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001193125-19-135910-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000119312519135910/d730491d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001193125-19-135910.txt",
    "filename": "1318605_8K_2019_0001193125-19-135910.htm",
    "item_1": "Item 1.01. Entry into a Material Definitive Agreement.\nUnderwritten Public Offering of Common Stock\nOn May 2, 2019, Tesla, Inc. (the “Company”) entered into an underwriting agreement (the “Common Stock Underwriting Agreement”) with Goldman Sachs & Co. LLC and Citigroup Global Markets Inc., acting for themselves and as representatives of the several underwriters named in Schedule I to each of the Underwriting Agreements, as defined below (collectively, the “Underwriters”), to issue and sell 3,086,419 shares of common stock, par value $0.001 per share (the “Common Stock”), of the Company in a public offering pursuant to a Registration Statement on Form S-3 (File No. 333- 231168 ) (the “Registration Statement”) and a related prospectus, including the related prospectus supplement (the “Common Stock Prospectus Supplement”), filed with the Securities and Exchange Commission (the “Common Stock Offering”). In addition, the Company granted the Underwriters an option to purchase, for a period of 30 calendar days from May 7, 2019, up to an additional 462,962 shares of Common Stock. The Company estimates that the net proceeds from the Common Stock Offering will be approximately $737.0 million, or approximately $847.6 million if the Underwriters exercise in full their option to purchase the additional shares of Common Stock, after deducting underwriting discounts and estimated offering expenses. The Common Stock Underwriting Agreement and a copy of the summary of the terms of the Common Stock Offering included in the Common Stock Prospectus Supplement are filed as Exhibit 1.1 and Exhibit 99.1, respectively, to this Current Report on Form 8-K and are incorporated herein by reference.\nUnderwritten Public Offering of 2.00% Convertible Senior Notes due May 15, 2024\nOn May 2, 2019, the Company entered into an underwriting agreement (the “Note Underwriting Agreement” and together with the Common Stock Underwriting Agreement, the “Underwriting Agreements”) with the Underwriters to issue and sell $1.60 billion aggregate principal amount of 2.00% Convertible Senior Notes due May 15, 2024 (the “Notes”) in a public offering pursuant to the Registration Statement and a related prospectus, including the related prospectus supplement (the “Note Prospectus Supplement”), filed with the Securities and Exchange Commission (the “Note Offering”). In addition, the Company granted the Underwriters an option to purchase, for a period of 30 calendar days from May 7, 2019, up to an additional $240.0 million aggregate principal amount of Notes solely to cover over-allotments. The Company estimates that the net proceeds from the Note Offering will be approximately $1.58 billion, or approximately $1.82 billion if the Underwriters exercise in full their option to purchase the additional Notes, after deducting underwriting discounts and estimated offering expenses. The Note Underwriting Agreement and a copy of the summary of the terms of the Note Offering included in the Note Prospectus Supplement are filed as Exhibit 1.2 and 99.2, respectively, to this Current Report on Form 8-K and are incorporated herein by reference.\nThe Notes will be issued pursuant to a supplemental indenture to be entered into supplementing the Indenture, dated May 22, 2013, by and between the Company and U.S. Bank National Association, as trustee.\nNote Hedge Transactions\nOn May 2, 2019, in connection with the offering of the Notes, the Company entered into note hedge transactions (the “Note Hedge Transactions”) with each of Société Générale, Wells Fargo Bank, National Association, Goldman Sachs & Co. LLC, and Credit Suisse Capital LLC, with Credit Suisse Securities (USA) LLC as agent, or their respective affiliates (the “Hedge Counterparties”) pursuant to call option confirmations in substantially the form filed as Exhibit 10.1 to this Current Report on Form 8-K and which is incorporated herein by reference. The Note Hedge Transactions are expected generally to reduce the potential dilution to the Common Stock and/or offset potential cash payments in excess of the principal amount upon any conversion of the Notes in the event that the market value per share of the Common Stock, as measured under the terms of the Note Hedge Transactions, is greater than the strike prices of the Note Hedge Transactions (which corresponds to the initial conversion prices of the Notes and is subject to certain adjustments substantially similar to those contained in the Notes). The Company expects to use approximately $413.8 million from the net proceeds from the issuance and sale of the Notes to pay for the Note Hedge Transactions.\nIf the Underwriters exercise their option to purchase additional Notes pursuant to the Note Underwriting Agreement, the Company expects to enter into additional note hedge transactions, in substantially the form filed as Exhibit 10.1 to this Current Report on Form 8-K, with the Hedge Counterparties with respect to such additional Notes.\nWarrant Transactions\nOn May 2, 2019, in connection with the offering of the Notes, the Company entered into warrant confirmations with the Hedge Counterparties (the “Warrant Confirmations”), in substantially the form filed as Exhibit 10.2 to this Current Report on Form 8-K and which is incorporated herein by reference, pursuant to which the Company issued certain warrants (the “Warrants”). The Warrants allow the Hedge Counterparties to acquire, subject to anti-dilution adjustments, up to approximately 10.3 million shares of Common Stock at a strike price of $607.50 per share in respect of Warrants, which is also subject to adjustment. The Warrants would separately have a dilutive effect to the extent that the market value per share of the Common Stock exceeds the strike price of the Warrants unless, subject to the terms of the Warrant Confirmations, the Company elects to cash settle the Warrants. The Warrants were issued pursuant to the exemption provided by Section 4(a)(2) of the Securities Act of 1933, as amended. The Warrants are separate transactions, entered into by the Company with the Hedge Counterparties, and are not part of the terms of the Notes. Holders of the Notes will not have any rights with respect to the Warrants. The Company expects to receive aggregate proceeds of approximately $151.7 million from the sale of the Warrants to the Hedge Counterparties.\nIf the Underwriters exercise their option to purchase additional Notes pursuant to the Note Underwriting Agreement and the Company enters into additional note hedge transactions with the Hedge Counterparties, the Company expects to enter into additional corresponding warrant confirmations, in substantially the form filed as Exhibit 10.2 to this Current Report on Form 8-K, with the Hedge Counterparties.",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01. Other Events.\nOn May 2, 2019, the Company issued a press release announcing its proposed Common Stock Offering and Note Offering. A copy of this press release is filed as Exhibit 99.3 to this Current Report on Form 8-K and is incorporated herein by reference."
}