{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2019-02-01",
    "period_of_report": "2019-01-29",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-001597-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459019001597/tsla-8k_20190129.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-001597.txt",
    "filename": "1318605_8K_2019_0001564590-19-001597.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01\nOther Events.\nAs announced on January 30, 2019, Deepak Ahuja intends to retire after having served, apart from a 14-month gap, as the Chief Financial Officer of Tesla, Inc. (“Tesla”) since 2008. Mr. Ahuja will continue in his role as Tesla’s Chief Financial Officer for a brief period and thereafter intends to continue to serve as an advisor to Tesla to ensure a smooth transition.\nTesla also announced that upon Mr. Ahuja’s retirement, Tesla intends to appoint Zachary Kirkhorn, Tesla’s current Vice President, Finance, Financial Planning and Business Operations, to replace Mr. Ahuja as Tesla’s Chief Financial Officer. Mr. Kirkhorn joined Tesla in March 2010 to lead cost reduction and manufacturing efficiency efforts for the Tesla Roadster. He has since played critical roles in the development and execution of a number of major programs, including site selection and launch of Gigafactory 1 and the launches and ramps of Model X and Model 3.\n“I’d like to thank Deepak for his tremendous contributions to Tesla,” said Elon Musk, Tesla’s Chief Executive Officer. “Zach has been with Tesla for nine years, and he is incredibly talented and very well-known and respected among the Tesla team. We’re looking forward to him serving in his new role as CFO.”\n“I’ve been very inspired by Elon and the entire Tesla team. People here are brilliant, very passionate about the company’s mission and more driven than I have seen anywhere else,” said Mr. Ahuja. “It’s difficult to leave, but Tesla has now had two great quarters of profitability, and cash flow generation, which puts the company on a much more solid financial foundation to achieve future successes. I’m very confident in Zach’s leadership, and I’ve seen firsthand how he has proven himself over the years.”\n“I joined Tesla because I was so attracted to the company’s mission and vision,” said Mr. Kirkhorn. “We’re starting 2019 in a very strong financial position, and my focus is on continuing our momentum on cost management and operational efficiency so that we can get our products to more people and ultimately help us achieve our mission to accelerate the world’s transition to sustainable energy.”\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.\nTESLA, INC.\nBy:\n/s/ Dane Butswinkas\nDane Butswinkas\nGeneral Counsel\nDate: January 31, 2019"
}