{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2020-12-08",
    "period_of_report": "2020-12-08",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001193125-20-312194-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000119312520312194/d60067d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001193125-20-312194.txt",
    "filename": "1318605_8K_2020_0001193125-20-312194.htm",
    "item_1": "Item 1.01 Entry into a Material Definitive Agreement.\nOn December 8, 2020, Tesla, Inc. (“Tesla”) entered into an equity distribution agreement (the “Equity Distribution Agreement”) with Goldman Sachs & Co. LLC, Citigroup Global Markets Inc., Barclays Capital Inc., BNP Paribas Securities Corp., BofA Securities, Inc., Credit Suisse Securities (USA) LLC, Deutsche Bank Securities Inc., Morgan Stanley & Co. LLC, SG Americas Securities, LLC and Wells Fargo Securities, LLC, as sales agents (each, a “Sales Agent” and collectively, the “Sales Agents”), to sell shares of common stock, par value $0.001 per share, of Tesla (the “Common Stock”) having aggregate sales proceeds of up to $5.0 billion (the “Shares”), from time to time, through an “at-the-market” offering program (the “Offering”).\nUpon delivery of a placement notice and subject to the terms and conditions of the Equity Distribution Agreement, the Sales Agents will use reasonable efforts consistent with their normal trading and sales practices, applicable state and federal laws, rules and regulations, and the rules of the Nasdaq Global Select Market to sell the Shares from time to time based upon Tesla’s instructions for the sales, including any price, time or size limits specified by Tesla. Under the Equity Distribution Agreement, the Sales Agents may sell the Shares by any method permitted by law, including in ordinary brokers’ transactions, in negotiated transactions, in block trades, and in transactions that are deemed to be an “at-the-market offering” as defined in Rule 415(a)(4) under the Securities Act of 1933, as amended (the “Securities Act”). The Sales Agents’ obligations to sell the Shares under the Equity Distribution Agreement are subject to satisfaction of certain conditions, including customary closing conditions.\nThe Equity Distribution Agreement provides that the Sales Agents will be entitled to compensation for their services in the form of a commission of up to 0.25% of the aggregate gross proceeds from each sale of the Shares, and Tesla has agreed to reimburse the Sales Agents for certain specified expenses. Tesla has also agreed to provide the Sales Agents with customary indemnification and contribution rights. Tesla is not obligated to sell any Shares under the Equity Distribution Agreement and may at any time suspend solicitation and offers under the Equity Distribution Agreement. The Equity Distribution Agreement may be terminated by Tesla at any time by giving written notice to the Sales Agents for any reason or by each Sales Agent at any time, with respect to such Sales Agent only, by giving written notice to Tesla for any reason or immediately under certain circumstances, including but not limited to the occurrence of a material adverse change in the company. The Offering of the Shares pursuant to the Equity Distribution Agreement will terminate upon the termination of the Equity Distribution Agreement by Tesla or the Sales Agents.\nThe sales and issuances of the Shares under the Equity Distribution Agreement will be made pursuant to Tesla’s effective shelf registration statement on Form S-3 (File No. 333-231168) (the “Registration Statement”) declared effective by the Securities and Exchange Commission (the “SEC”) on May 2, 2019. On the date hereof, Tesla intends to file a prospectus supplement with the SEC in connection with the offer and sale of the Shares pursuant to the Equity Distribution Agreement.\nThe foregoing description of the Equity Distribution Agreement is not complete and is qualified in its entirety by reference to the full text of such agreement, a copy of which is filed herewith as Exhibit 1.1 to this Current Report on Form 8-K and is incorporated herein by reference.\nThis Current Report on Form 8-K shall not constitute an offer to sell or the solicitation of an offer to buy any securities under the Equity Distribution Agreement, nor shall there be any sale of such securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01 Other Events.\nIn connection with the Offering, the legal opinion as to the legality of the Common Stock sold is being filed as Exhibit 5.1 to this Current Report on Form 8-K and is incorporated herein and into the Registration Statement by reference."
}