{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2023-07-20",
    "period_of_report": "2023-07-19",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0000950170-23-033695-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000095017023033695/tsla-20230719.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0000950170-23-033695.txt",
    "filename": "1318605_8K_2023_0000950170-23-033695.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01\tOther Events.\nAs previously reported in our securities filings, certain current and former members of the board of directors of Tesla, Inc. (“Tesla”) were named as defendants in a stockholder derivative action in the Delaware Court of Chancery, captioned The Police and Fire Retirement System of the City of Detroit v. Elon Musk, et al., C.A. No. 2020-0477-KSJM (Del. Ch.) (“Action”).\nOn July 14, 2023, the parties to the Action entered into a Stipulation and Agreement of Compromise and Settlement (the “Stipulation”) to resolve the Action. The Stipulation and exhibits thereto, including the proposed Notice of Pendency and Proposed Settlement of Derivative Action (the “Notice”) and proposed Scheduling Order (the “Scheduling Order”), were filed in the Delaware Court of Chancery on July 14, 2023. The Stipulation is subject to final approval by the Delaware Court of Chancery. The Stipulation, if finally approved, will cause the dismissal with prejudice of the Action.\nOn July 19, 2023, the Delaware Court of Chancery entered the Scheduling Order, which includes approval of the Notice. Resolution of the Action is subject to approval from the Delaware Court of Chancery. The Delaware Court of Chancery set a final settlement hearing for October 13, 2023, at 1:30 p.m. ET before the Honorable Kathaleen St. J. McCormick in the Delaware Court of Chancery, New Castle County, Leonard L. Williams Justice Center, 500 North King Street, Wilmington, Delaware 19801.\nPursuant to the Scheduling Order, a copy of the Notice (which includes, among other things, the proposed terms and conditions to resolve the Action) is attached hereto as Exhibit 99.1"
}