{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2019-08-16",
    "period_of_report": "2019-08-16",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-032484-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459019032484/tsla-8k_20190816.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-032484.txt",
    "filename": "1318605_8K_2019_0001564590-19-032484.htm",
    "item_1": "Item 1.01.\nEntry into a Material Definitive Agreement.\nExtension of Vehicle Lease Warehouse Agreements\nOn August 16, 2019, certain subsidiaries of Tesla, Inc. (“Tesla”) that are respectively parties to (i) an Amended and Restated Loan and Security Agreement, executed on August 17, 2017 (the “A&R 2016 Warehouse Agreement”), and (ii) a Loan and Security Agreement, executed on December 28, 2018 (the “2018 Warehouse Agreement,” and together with the A&R 2016 Warehouse Agreement, the “Warehouse Agreements”) with Deutsche Bank AG, New York Branch as administrative agent and the other parties therein, entered into an amendment to each of the Warehouse Agreements (together, the “Amendments”).\nAmong other changes, the Amendments extended the borrowing availability date under the Warehouse Agreements from August 16, 2019 to August 14, 2020 and extended the maturity date of the Warehouse Agreements from September 2020 to September 2021. The aggregate lender commitment, which is shared between the Warehouse Agreements, remains unchanged at $1.1 billion.",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01.\nOther Events.\nRe-registration of Tesla Shares Issuable Pursuant to Subsidiary Convertible Notes\nOn August 16, 2019, Tesla filed a prospectus supplement to the prospectus dated May 1, 2019 included in its Registration Statement on Form S-3 (File No. 333-231168) (the “Registration Statement”), to register shares of Tesla’s common stock issuable upon the conversion of outstanding convertible notes of Tesla’s wholly-owned subsidiary, SolarCity Corporation (the “Re-registration”). The Re-registration was effected solely because the previous registration statement under which the above-referenced shares of Tesla common stock were previously registered expired on May 18, 2019. Accordingly, no additional shares were registered for the first time as a result of the Re-registration.\nThe legal opinion as to the legality of the shares of Tesla common stock registered pursuant to the Re-registration is being filed as Exhibit 5.1 to this Current Report on Form 8-K and is incorporated herein and into the Registration Statement by reference."
}