{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2019-04-19",
    "period_of_report": "2019-04-18",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-012122-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459019012122/tsla-8k_20190418.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-19-012122.txt",
    "filename": "1318605_8K_2019_0001564590-19-012122.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01 Other Events.\nIn connection with certain stockholder-friendly corporate governance initiatives as described in Tesla’s preliminary proxy statement on Schedule 14A filed with the SEC on April 19, 2019 (the “Preliminary Proxy Statement”), Tesla’s Board of Directors (the “Board”) and Nominating and Corporate Governance Committee reviewed the Board’s composition, focusing on a phased streamlining of the size of the Board to allow it to operate more nimbly and efficiently, while maintaining new ideas, expertise and experiences on the Board.\nAs a result, on April 18, 2019, each of Brad Buss, Antonio Gracias, Stephen Jurvetson, and Linda Johnson Rice agreed collectively with the Board and its Nominating and Corporate Governance Committee that each of them will not stand for re-election to the Board at the expiration of their respective current terms, which will be at the 2019 annual meeting of stockholders for Mr. Buss and Ms. Rice, at the 2020 annual meeting of stockholders for Mr. Jurvetson and, if our stockholders approve a director term reduction proposal as described in the Preliminary Proxy Statement, for Mr. Gracias. If our stockholders do not approve such proposal, Mr. Gracias’ term will end at the 2021 annual meeting of stockholders. Such agreements did not result from any disagreement between Tesla and any of such directors.\nOther Information\nTesla plans to file with the Securities and Exchange Commission (the “SEC”), and furnish to its stockholders, a definitive proxy statement in connection with the 2019 annual meeting of stockholders (the “Definitive Proxy Statement”). The Definitive Proxy Statement will contain important information about the matters to be voted on at the 2019 annual meeting. STOCKHOLDERS OF TESLA ARE URGED TO READ THESE MATERIALS (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO) AND ANY OTHER RELEVANT DOCUMENTS THAT TESLA WILL FILE WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT TESLA AND THE MATTERS TO BE VOTED ON AT THE 2019 ANNUAL MEETING. Stockholders will be able to obtain free copies of these documents and other documents filed with the SEC by Tesla through the website maintained by the SEC at www.sec.gov. In addition, stockholders will be able to obtain free copies of these documents from Tesla by contacting Tesla’s Investor Relations by e-mail at ir@tesla.com, or by going to Tesla’s Investor Relations page on its website at ir.tesla.com.\nParticipants in the Solicitation\nThe directors and executive officers of Tesla may be deemed to be participants in the solicitation of proxies from the stockholders of Tesla in connection with 2019 annual meeting. Information regarding the interests of participants in the solicitation of proxies, if any, in respect of the 2019 annual meeting will be included in the Definitive Proxy Statement.\nForward-Looking Statements\nCertain statements in this report are forward-looking statements that are subject to risks and uncertainties. These forward-looking statements are based on management’s current expectations. Various important factors could cause actual results to differ materially, including the risks identified in our SEC filings. Tesla disclaims any obligation to update any forward-looking statement contained in this report and the exhibit hereto.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.\nTESLA, INC.\nBy:\n/s/ Jonathan A. Chang\nJonathan A. Chang\nGeneral Counsel\nDate: April 19, 2019"
}