{
    "cik": "789019",
    "company": "MICROSOFT CORP",
    "filing_type": "8-K",
    "filing_date": "2022-01-18",
    "period_of_report": "2022-01-18",
    "sic": "7372",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-22-010667-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/000119312522010667/d301984d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-22-010667.txt",
    "filename": "789019_8K_2022_0001193125-22-010667.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "Item 7.01 Regulation FD Disclosure.\nOn January 18, 2022, Microsoft Corporation (“Microsoft”) issued a press release announcing that it had entered into a definitive agreement pursuant to which Microsoft will acquire Activision Blizzard, Inc. (“Activision Blizzard”) for $95.00 per share in an all-cash transaction valued at $68.7 billion, inclusive of Activision Blizzard’s net cash. The full text of the press release is attached as Exhibit 99.1 and is incorporated by reference herein.\nOn and after January 18, 2022, representatives of Microsoft and Activision Blizzard will present information about the transaction to various investors. The presentation will include the slides attached hereto as Exhibit 99.2 and incorporated by reference herein.\nIn accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1 and Exhibit 99.2, shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liability of that section, and shall not be incorporated by reference into any registration statement or other document filed under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.",
    "item_7A": "",
    "item_8": ""
}