{
    "cik": "789019",
    "company": "MICROSOFT CORP",
    "filing_type": "8-K",
    "filing_date": "2023-10-16",
    "period_of_report": "2023-10-16",
    "sic": "7372",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/789019/0001104659-23-109428-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/000110465923109428/tm2328507d1_8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/0001104659-23-109428.txt",
    "filename": "789019_8K_2023_0001104659-23-109428.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01 Other Events.\nExchange Offers and Consent Solicitations\nOn October 16, 2023, Microsoft Corporation (“Microsoft”) announced that, in connection with the previously announced merger of Activision Blizzard, Inc. (“Activision Blizzard”) with and into a wholly-owned subsidiary of Microsoft (the “Merger”), with Activision Blizzard surviving the Merger as a wholly-owned subsidiary of Microsoft, Microsoft has commenced offers to exchange (each, an “Exchange Offer” and, collectively, the “Exchange Offers”) any and all outstanding notes issued by Activision Blizzard (the “Existing Activision Blizzard Notes”) for (1) up to $3,650,000,000 aggregate principal amount of new notes to be issued by Microsoft (the “New Microsoft Notes”) and (2) cash. Concurrently with the Exchange Offers being made by Microsoft, Activision Blizzard is, upon Microsoft’s request, soliciting consents (each, a “Consent Solicitation” and, collectively, the “Consent Solicitations”) to adopt certain proposed amendments to each of the corresponding indentures governing the Existing Activision Blizzard Notes to eliminate certain of the covenants, restrictive provisions and events of default from such indentures.\nEach Exchange Offer and Consent Solicitation is conditioned upon the completion of the other Exchange Offers and Consent Solicitations, although Microsoft may waive such condition at any time with respect to an Exchange Offer.\nThe New Microsoft Notes have not been registered with the Securities and Exchange Commission (the “SEC”) under the Securities Act of 1933, as amended (the “Securities Act”), or any state or foreign securities laws. Therefore, the New Microsoft Notes may not be offered or sold in the United States or to any U.S. person absent registration, except pursuant to an applicable exemption from, or in a transaction not subject to, the registration requirements of the Securities Act.\nThe Exchange Offers and Consent Solicitations are being made pursuant to the terms and subject to the conditions set forth in the offering memorandum and consent solicitation statement dated as of October 16, 2023 (as it may be amended or supplemented, the “Offering Memorandum and Consent Solicitation Statement”). A copy of the press release announcing the Exchange Offers and the Consent Solicitations is furnished herewith as Exhibit 99.1 and is incorporated herein by reference.\nThe information in this Item 8.01, as well as Exhibit 99.1 attached hereto, is being furnished, not filed. Accordingly, such information will not be incorporated by reference into any registration statement filed by Microsoft under the Securities Act, unless specifically identified as being incorporated by reference therein.\nCautionary Statement Regarding Forward-Looking Information\nThis communication includes forward-looking statements within the meaning of federal securities laws. All statements, other than statements of historical fact, included in this communication are forward-looking statements. Such forward-looking statements include, but are not limited to, statements about the timing of the Exchange Offers and Consent Solicitations. No assurances can be given that the forward-looking statements contained in this communication will occur as expected and actual results may differ materially from those included in this communication. Forward-looking statements are based on current expectations and assumptions that involve a number of risks and uncertainties that could cause actual results to differ materially from those included in this communication. Important risks, uncertainties and other factors are described in the Offering Memorandum and Consent Solicitation Statement, Microsoft’s Annual Report on Form 10-K for the fiscal year ended June 30, 2023, Current Reports on Form 8-K and other filings Microsoft makes with the SEC and in Activision Blizzard’s Annual Report on Form 10-K for the year ended December 31, 2022, Activision Blizzard’s Quarterly Reports on Form 10-Q for the quarterly periods ended March 31, 2023 and June 30, 2023, Current Reports on Form 8-K and other filings Activision Blizzard makes with the SEC. Forward-looking statements are based on the estimates and opinions of management at the time the statements are made. Except to the extent required by applicable law, neither Microsoft nor Activision Blizzard undertakes any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. You are cautioned not to place undue reliance on these forward-looking statements that speak only as of the date hereof.\nNo Offer or Solicitation\nThis communication is not intended to and shall not constitute an offer to sell or purchase, or a solicitation of an offer to sell or purchase, or the solicitation of tenders or consents with respect to, any security. No offer, solicitation, purchase or sale will be made in any jurisdiction in which such an offer, solicitation, or sale would be unlawful. The Exchange Offers and Consent Solicitations are being made to eligible holders solely pursuant to the Offering Memorandum and Consent Solicitation Statement and only to such persons and in such jurisdictions as is permitted under applicable law."
}