{
    "cik": "789019",
    "company": "MICROSOFT CORP",
    "filing_type": "8-K",
    "filing_date": "2023-10-30",
    "period_of_report": "2023-10-27",
    "sic": "7372",
    "state_of_inc": "WA",
    "state_location": "WA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-23-265616-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/000119312523265616/d572684d8k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/789019/0001193125-23-265616.txt",
    "filename": "789019_8K_2023_0001193125-23-265616.htm",
    "item_1": "",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01 Other Events.\nOn October 27, 2023, Microsoft Corporation (“Microsoft”) issued a press release announcing the early tender results of its previously announced offers to exchange (collectively, the “Exchange Offers”) any and all outstanding notes issued by Activision Blizzard, Inc., a wholly-owned subsidiary of Microsoft (“Activision Blizzard”) (such notes, the “Existing Activision Blizzard Notes”), for (1) up to $3,650,000,000 aggregate principal amount of new notes issued by Microsoft (the “New Microsoft Notes”) and (2) cash, and solicitations of consents by Activision Blizzard (collectively, the “Consent Solicitations”) to adopt certain proposed amendments to each of the corresponding indentures governing the Existing Activision Blizzard Notes.\nThe New Microsoft Notes have not been registered with the Securities and Exchange Commission under the Securities Act of 1933, as amended (the “Securities Act”), or any state or foreign securities laws. Therefore, the New Microsoft Notes may not be offered or sold in the United States or to any U.S. person absent registration, except pursuant to an applicable exemption from, or in a transaction not subject to, the registration requirements of the Securities Act.\nA copy of the press release is filed as Exhibits 99.1 to this Current Report on Form 8-K and is incorporated herein by reference.\nNo Offer or Solicitation\nThis communication is not intended to and shall not constitute an offer to sell or purchase, or a solicitation of an offer to sell or purchase, or the solicitation of tenders or consents with respect to, any security. No offer, solicitation, purchase or sale will be made in any jurisdiction in which such an offer, solicitation, or sale would be unlawful. The Exchange Offers and Consent Solicitations are being made to eligible holders solely pursuant to the Offering Memorandum and Consent Solicitation Statement, dated October 16, 2023, and only to such persons and in such jurisdictions as is permitted under applicable law."
}