{
    "cik": "1318605",
    "company": "Tesla, Inc.",
    "filing_type": "8-K",
    "filing_date": "2020-02-19",
    "period_of_report": "2020-02-13",
    "sic": "3711",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-20-005288-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/000156459020005288/tsla-8k_20200213.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1318605/0001564590-20-005288.txt",
    "filename": "1318605_8K_2020_0001564590-20-005288.htm",
    "item_1": "Item 1.01Entry into a Material Definitive Agreement.\nOn February 13, 2020, Tesla, Inc. (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with Goldman Sachs & Co. LLC and Morgan Stanley & Co. LLC, as representatives of the several underwriters named in Schedule I thereto (the “Underwriters”), to issue and sell 2,650,000 shares of common stock, par value $0.001 per share (the “Common Stock”), of the Company in a public offering pursuant to a Registration Statement on Form S-3 (File No. 333- 231168 ) (the “Registration Statement”) and a related prospectus, including the related prospectus supplement (the “Prospectus Supplement”), filed with the Securities and Exchange Commission (the “Offering”). In addition, the Company granted the Underwriters an option to purchase, for a period of 30 calendar days from February 13, 2020, up to an additional 397,500 shares of Common Stock, which the Underwriters exercised in full pursuant to a notice delivered to the Company on February 18, 2020. The Offering, including the sale of shares of Common Stock subject to the Underwriters’ option, closed on February 19, 2020, and the net proceeds were approximately $2.31 billion, after deducting underwriting discounts and commissions and estimated offering expenses. The Underwriting Agreement is filed as Exhibit 1.1 to this Current Report on Form 8-K and is incorporated herein by reference.",
    "item_1A": "",
    "item_7": "",
    "item_7A": "",
    "item_8": "Item 8.01Other Events.\nIn connection with the Offering, the legal opinion as to the legality of the Common Stock sold is being filed as Exhibit 5.1 to this Current Report on Form 8-K and is incorporated herein and into the Registration Statement by reference.\nOn February 13, 2020, the Company issued a press release announcing the Offering. A copy of this press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference."
}